app/controllers/concerns/clerk_authenticatable.rb

SELECT "users".* FROM "users" WHERE "users"."clerk_id" = 'dev_landlord_1' LIMIT 1
---
  def authenticate_clerk_user!
    # Dev bypass: in development, allow X-Dev-Clerk-Id header to skip JWT verification
    if Rails.env.development? && request.headers["X-Dev-Clerk-Id"].present?
      @current_user = User.find_by(clerk_id: request.headers["X-Dev-Clerk-Id"])